#include "ioCC2530.h" //引用CC2530头文件
/**************************************************************
函数名称：delay
功    能：软件延时
入口参数：time--延时循环执行次数
出口参数：无
返 回 值：无
**************************************************************/
void delay(unsigned int time)
{
    unsigned int i;
    unsigned char j;
    for(i = 0;i < time;i++)
        for(j = 0;j < 240;j++)
        {
            asm("NOP");//asm用来在C代码中嵌入汇编语言操作，汇
            asm("NOP");//编命令nop是空操作，消耗1个指令周期。
            asm("NOP");
        }
}

/**************************************************************
函数名称：main
功    能：程序主函数
入口参数：无
出口参数：无
返 回 值：无
**************************************************************/
void main(void)
{
    P1SEL &= ~0xff;//设置P1口所有位为普通IO口
    P1DIR |= 0xff;//设置P1口所有位为输出口
    
    while(1)//程序主循环
    {
        P1 = ~P1;//P1口输出状态反转
        delay(1000);//延时
    }
}